<?php

namespace Database\Seeders;

use App\Models\Note;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class NoteSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Note::create([
            'note_desc' => 'TNG',
            'note_text' => 'Во комерцијалната ознака на типот на возило се додава ознаката "TNG" која означува дека во возилото е вграден уред за погон на течен нафтен гас.'
        ]);
        Note::create([
            'note_desc' => 'TNG согласно ECE-R 67.01',
            'note_text' => 'Во комерцијалната ознака на возилото се додава ознаката (TNG*) која што означува дека во возилото е вграден уред за погон на течен нафтен гас.Масата на возилото е зголемена за масата на компонентите од уредот.Уредот е вграден согласно регулативата ECE-R 67.01'
        ]);
        Note::create([
            'note_desc' => 'Клима фолии',
            'note_text' => 'Предмет на испитување е дополнително вградување на клима-фолии на сигурносните стакла.Преправката на возилото (вградување на фолиите) е извршено правилно.На предното ветробранско стакло и на бочните стакла на предните врати не се вградени фолии.На останатите бочни стакла и на задното сигурносно стакло се вградени фолии.Пропусливоста на светлината на сите останати бочни и на задното ветробранско стакло,заедно со на нив налепените фолии,изнесува %.Возилото е опремено со два надворешни ретровизора.'
        ]);
        Note::create([
            'note_desc' => 'Фабрички затемнети стакла',
            'note_text' => 'ВОЗИЛОТО ИМА МАТИЧНО ВГРАДЕНИ, ДОПОЛНИТЕЛНО ЗАТЕМНЕТИ ЗАДНИ СТРАНИЧНИ СТАКЛА И ЗАДНО ВЕТРОБРАНСКО СТАКЛО, СО ХОМОЛОГАЦИСКА ОЗНАКА “V”.'
        ]);
        Note::create([
            'note_desc' => 'N3/BA кесон во N3/BA-кипер',
            'note_text' => 'Предметното возило било N3/BA Кесон отворен, Преправен е во N3/BA – КЕСОН ОТВОРЕН КИППЕР. Преправката е прописно направена шри што се земени во предвид препораките на производителот на возилото за таков вид на преправки и е во согласност со барањата на членот 44 од ПРАВИЛНИКОТ ЗА ТЕХНИЧКИТЕ БАРАЊА ЗА СИСТЕМИТЕ, СОСТАВНИТЕ ДЕЛОВИ, САМОСТОЈНИТЕ ТЕХНИЧКИ ЕДИНИЦИ, ОПРЕМАТА, ДИМЕНЗИИТЕ И ВКУПНИТЕ МАСИ И ОСНОТО ОПТОВАРУВАЊЕ НА ВОЗИЛАТА (Сл.весник на Р.М. 21/2010). Најголемата конструктивна маса на возилото (F.1) изнесува 26000 kg, а најголемата легална вкупна маса при регистрација (F.2) изнесувала 26.000 kg а со преправката е променета на 32.000кг. Масата на возилтоо по извршената преправка G изнесува 13.157кг кг а нејзината дистрибуција по оски напред 6011кг кг а назад 3627кг и 3520 кг. Геомериските параметри се променети и должина 8.300мм, ширина 2.550 мм, висина 2960.'
        ]);
        Note::create([
            'note_desc' => 'Промена на мотор од ист тип различен подтип',
            'note_text' => 'Предмет на испитувањето е промената на погонски агрегат (мотор) на возилото од ист производител ист тип а различен подтип. Соред барањата од ПРАВИЛНИКОТ ЗА ПРЕПРАВАНИ И ПОПРАВАНИ ВОЗИЛА (Сл.весник на Р.М. 7/2010), со промената на преправката на возилото масените параметри на возилото нема промена на категотија на возилто. Не е променета најголемата легална вкупна маса на возилото при регистрација G, и таа изнесува од 1365 kg. Преправката на вградување на моторото е изведена според препораките на производителот на возилото. Промената на матичниот мотор од тип BXF дизел со зафатнина 1896 сс3 и 66 kW со дизел мотор тип BXE со зафатнина 1896 сс3 и снага од 77 кW. Сите врски со каросеријата и системот се во согласност со препораките на производителот на возилто и Правилникот за преправани и поправани возила. Оваа Потврда ги содржи идентификационите податоци и податоците поврзани со предметот на испитувањето на возилото; Еколошките параметри на возилото се од иста категорија Euro 4.'
        ]);
        Note::create([
            'note_desc' => 'Промена на масени параметри N2 во N1',
            'note_text' => 'Возилото е произведено N2 / BB – Фуругон, Преправен т.е. променета се состои во промена на масените параметри на фуругонот при што класта е променета во N1 а формата е задржана т.е. непроменета BB -фуругон. Најголемата конструктивна маса на возилото (F.1) е непроменета и изнесува 5.000 kg, а најголемата легална вкупна маса при регистрација (F.2) која била 5.000 е променета и изнесува 3.500 kg при што на возилот не се направени конструктивни промени. Масата на возилотое G е останата непроменета и таа е 2.325 кг. Најголемата легална маса при регистрација F2 од 3.500 кг е во согласност со фабричките препораки за корективни преправки на носивост на фуругонот.'
        ]);
        Note::create([
            'note_desc' => 'ТНГ за технички извешта во НАОД',
            'note_text' => 'Предмет на техничкиот извештај за возилото е вграден дополнително уред за погон на течен нафтен гас ТНГ производител LAND RENZO. Уредот како целина ги исполнува сите барања врска регулативата ECE R67-01. Сите компоненти се прописнбо поставени и сите ја исполнуваат регулативата ECE R67-01 и соодветно на тоа носат втиснати ознаки. Резервоарот за гас е од производител ATIKER и тој е соодветен и ги испонува бараите законски регулативи. Соред барањата од ПРАВИЛНИКОТ ЗА ПРЕПРАВАНИ И ПОПРАВАНИ ВОЗИЛА (Сл.весник на Р.М. 7/2010), со промената на преправката на возилото масените параметри на возилото нема промена на категотија на возилто. Масата на возилот G е променета и таа по преправката изнесува 1587 kg. Преправката на вградување на дополнителниот уред е изведена според препораките на производителот на возилото и производителот на дополителниот уред за течен нафтен гас ТНГ.'
        ]);
        Note::create([
            'note_desc' => 'Масени Параметри, Промена на маса F2',
            'note_text' => 'Предмет на техничкиот извештај за возилото е вграден дополнително уред за погон на течен нафтен гас ТНГ производител LAND RENZO. Уредот како целина ги исполнува сите барања врска регулативата ECE R67-01. Сите компоненти се прописнбо поставени и сите ја исполнуваат регулативата ECE R67-01 и соодветно на тоа носат втиснати ознаки. Резервоарот за гас е од производител ATIKER и тој е соодветен и ги испонува бараите законски регулативи. Соред барањата од ПРАВИЛНИКОТ ЗА ПРЕПРАВАНИ И ПОПРАВАНИ ВОЗИЛА (Сл.весник на Р.М. 7/2010), со промената на преправката на возилото масените параметри на возилото нема промена на категотија на возилто. Масата на возилот G е променета и таа по преправката изнесува 1587 kg. Преправката на вградување на дополнителниот уред е изведена според препораките на производителот на возилото и производителот на дополителниот уред за течен нафтен гас ТНГ.'
        ]);
        Note::create([
            'note_desc' => 'N1 во M1',
            'note_text' => 'Предмет на испитувањето е преправка на возилото од товарно-фургон во патничко. Преправката е исправно извршена. По извршеното испитување е утврдено дека возилото во целост е адаптирано да се експлоатира како патничко со вкупно 5 седишта. Имено каросеријата му е целосно застаклена, патничка верзија со сигурносни стакла на прозорците одобрени според ECE-R43. Внатрешноста е интегрален простор со систем за проветрување и кондиционирање на воздухот, како и страници, таван и под соодветно обложени-тапацирани. На него постојат прописен број на соодветни влезови и излези за патниците и возачот. Вградените седишта се фабрички поставени со прописно прицвстување и сигурносни ремени и наслони за глава поставени со број, јачина и распоред според упатствата од производителот. Останатите негови перформанси, уреди и опрема ги исполнуваат барањата за возила од категоријата М1, произведени во 2007 година.; Euro 4'
        ]);
        Note::create([
            'note_desc' => 'Промена на број на седишта',
            'note_text' => 'Предмет на испитувањето е промената на бројот на седишта на возилото, обликот и намената на каросеријата е непроменет N2 категорија и облика на каросерија ВВ-Фургон.Бројот на седишта S1 бил 2 со преправката е проментет во 3. Вградено е дополнително оригинално седиште од производителот на возилто со сите карактеристики за категоријата. Соред барањата на членот 44 од ПРАВИЛНИКОТ ЗА ТЕХНИЧКИТЕ БАРАЊА ЗА СИСТЕМИТЕ, СОСТАВНИТЕ ДЕЛОВИ, САМОСТОЈНИТЕ ТЕХНИЧКИ ЕДИНИЦИ, ОПРЕМАТА, ДИМЕНЗИИТЕ И ВКУПНИТЕ МАСИ И ОСНОТО ОПТОВАРУВАЊЕ НА ВОЗИЛАТА (Сл.весник на Р.М. 21/2010), со промената не се променети масените параметри на возилото F1 и F2. Поради преправката променета е асата на празно возило G која била 3800 кг а по преправката е 3850 кг. Оваа Потврда ги содржи идентификационите податоци и податоците поврзани со предметот на испитувањето на возилото.'
        ]);
        Note::create([
            'note_desc' => 'Масени параметри N1 BB во N1 BB промена на F2',
            'note_text' => 'Возилото е произведено N1 / BB – Фуругон, Преправен т.е. променета се состои во промена на масените параметри на фуругонот при што класта не е променета ниту обликот на каросерија. Најголемата конструктивна маса на возилото (F.1) е непроменета и изнесува 2.800 kg, а најголемата легална вкупна маса при регистрација (F.2) која била 2.800 е променета а врска препораките на опсег на оптеретување и изнесува 2.600 kg при што на возилот не се направени конструктивни промени. Масата на возилотое G е останата непроменета и таа е 1.710 кг. Еколошките карактеристики на возилото се останати исти Еуро 1.'
        ]);
        Note::create([
            'note_desc' => 'SG',
            'note_text' => 'Возилто е произведено N2/BA-кесон затворен. На возилто се направени преправки: -Променети се масените параметри при што возилто ја променило класата од N2/BA- кесон во N3/BA кесон притоа не е променета најголемата конструктивна маса F1 која изнесува 11990 кг а променета е најголемата легална вкупна маса при регистрација F2 која била 11.990кг е променета во 12.100 кг. Преправката е по препорака на производителот и неговите опсези за корекција на масени параметри. -Променет е и бројот на седишта кој бпред преправката бил S1: 2 седишта по преправката вградено е дополнително оригинално хомологирано седиште на производителот со соодветна хомологациска ознака при што по преправката возилото го променил бројот на седишта во S1: 3 седишта. При преправката не се променети геометриските ниту масените параметри. Променета е сопствената маса на возилото G која била 6850 кг по промената е зголемена на 6.920 кг. -Променет е и обликот на каросерија од BA-кесон затворен во SG-авто школа. Имено на возилот се дополнително вградени паралелни команди со лостови за обука на возачи. За преправката е приложен и елеборат со технички извештај на надградителот. Преправката е прописно направена врска препораките за таков тип на преправки и возила. Со преправката возилото не ја променило категоријата N3. Прио преправката нема промена на геометриски и масени параметри на возилто. променета е сопствената маса на возилото G која по преправката е 6.990 кг. Сите преправкаи ее прописно направена при што се земени во предвид препораките на производителот на возилото за таков вид на преправки и е во согласност со барањата на членот 44 од ПРАВИЛНИКОТ ЗА ТЕХНИЧКИТЕ БАРАЊА ЗА СИСТЕМИТЕ, СОСТАВНИТЕ ДЕЛОВИ, САМОСТОЈНИТЕ ТЕХНИЧКИ ЕДИНИЦИ, ОПРЕМАТА, ДИМЕНЗИИТЕ И ВКУПНИТЕ МАСИ И ОСНОТО ОПТОВАРУВАЊЕ НА ВОЗИЛАТА (Сл.весник на Р.М. 21/2010).'
        ]);
        Note::create([
            'note_desc' => 'BB/SG Ладилник',
            'note_text' => 'Возилото е произведено како N1/BB-ФУРГОН, но во меѓувреме е преправено во BB/SG-ФУРГОН ЛАДИЛНИК, при што категоријата останува N1. По преправката возилото ги исполнува барањата согласно прилог II од Правилникот за единечно одобрување на возило. Преправка на возилото во ФУРГОН ЛАДИЛНИК е исправно извршена врска препораките на производителот на возилото и Производителот на разладниот уред Thermo King модел C250e10. Во товарниот внатрешен дел поставена е соодветна термичка изолација и е вграден ладилниот уред. Со преправката е променета масата на празно возило (G) и таа сега изнесува 2480kg. Возилото со своите перформанси, уреди и опрема ги исполнува барањата за возила од N1 категорија.; Euro 6.'
        ]);
        Note::create([
            'note_desc' => 'КУКА',
            'note_text' => 'На возилото е вграден ВГРАДЕН МЕХАНИЧКИ УРЕД ЗА СПОЈУВАЊЕ НА МОТОРНОТО СО ПРИКЛУЧНО ВОЗИЛО(КУКА), марка: AvtoS тип: УАЗ-01; класа на спојна А50-X број на одобрение: TC RU C-RU.AB29.B.14279 D- 5,88 kN; S- 75 kg. Преправката е направена согласно препораките на производителот и техничкиот извештај бр 8/55/692-18. Со преправкате променета е масата на возилто G од 1890 кг во 1930 kg. Геометриските параметри и еколошките параметри на возилото остануваат непроменети.'
        ]);
        Note::create([
            'note_desc' => 'ПЛОЧКА СО МАСИ',
            'note_text' => 'При преглед на возилото констатирано е дека на лице место несостасува МАТИЧНАТА ПЛОЧКА СО МАСЕНИ ПАРАМЕТРИ. Од извршениот преглед на возилото и приложената документација: TUV Nord Mobilitat Потврда за исполнување на техники карактеристики, сообраќајна дозвола и физички преглед на возилто констатирано е дека за возило марка BMW, тип X70, варијанта FF41, верзија /, масените параметри се следни F1: 2740; F2: 2740; F3: 5560 и масите по оски N1: 1295 и N2: 1545.'
        ]);
        Note::create([
            'note_desc' => 'М1 во N1',
            'note_text' => 'Предмет на испитувањето е преправка на возилото од патничко М1 во товарно-фургон BB. Преправката е исправно извршена. По извршеното испитување е утврдено дека возилото во целост е адаптирано да се експлоатира како патничко со вкупно 2 седишта. Имено каросеријата во товарниот дел му е прописно преградена при што се обезбедени услови за безбеден превоз на товоар врска ЕЕЦ нормите. Внатрешноста како страници, таван и под соодветно обложени-тапацирани. Вградените седишта се фабрички 2 на број се фабрички поставени . Останатите негови перформанси, уреди и опрема ги исполнуваат барањата за возила од категоријата N1, произведени во ???? година.; Euro ?'
        ]);
        Note::create([
            'note_desc' => 'Електричен мотор',
            'note_text' => 'Предмет на испитувањето е регулирање на снагата на електричниот мотор воз возилото. Возилото е со погон на електромотор тип EAG со максимална снага на моторот од 85 kw. Возилото има три мода на експлоатација а притоа и регулација на максималната снага на истото. На возилото во функција му е поставен модот ЕКО со кој максималната снага за експлоатација е 70 kw. Модот со 70 kw поставен да биде основен за експлоатација на возилото а максималниот од 85 kw не е во функција. Направената промена на возилото е во согласност со препораките на производителот на моторви на режим на работа на возилото. Еколосшките параметри се останати исти како фабричките испитувани за модот ЕCO со 70kw т.е. Еуро 6.'
        ]);
        Note::create([
            'note_desc' => 'Легализација',
            'note_text' => 'Предметното возило ги исполнува условите за легализација согласно одредбите на законот за возила (Сл.весник на Р.С.Македонија бр.87/2023).Издаденава СОГЛАСНОСТ ЗА РЕГИСТРАЦИЈА важи исклучиво само во комбинација со издадено ОДОБРЕНИЕ ЗА ЛЕГАЛИЗАЦИЈА од страна на надлежен суд и Потврда за регистрација (платени царински давачки) издадена од Царинска Управа на Р.С.Македонија.'
        ]);
        Note::create([
            'note_desc' => 'За четрицикили за ограничување брзина',
            'note_text' => 'FB-ШУМСКО*Декларираната максимална брзина на возилото според ЦОЦ-документот е 60 км/ч(според ЕУ регулативата e13*167/2013*00420*00).На согласноста што ја издаваме истата изнесува 40 км/ч според категоризацијата на возила која важи во Р.С. Македонија(Правилник за одобрување на нови возила,системи,составни делови и самостојни технички единици за таквите возила,Сл.Весник на Р.С.Македонија бр.132 од 02.11.2009 година)*'
        ]);
        Note::create([
            'note_desc' => 'Евидентирање на Матични Податоци',
            'note_text' => 'Направено е испитување и евидентирање на матични податоци на возилото Марка: LADA Тип: 2121: Варијанта:/ Верзија:/. За увид користени се податоци од Потврда на TUV Nord Mobilitat. Утврдени се: Комерцијална оознака NIVA 4x4 , категорија од М1 во M1G(возило со зголемена проодност), како направени се евидентирање на сите масени и геометриски парамери на возилото.'
        ]);
    }
}
