<?php

namespace Database\Seeders;

use App\Models\Relateddocuments;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class RelateddocumentsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Relateddocuments::create([
            'desc' => 'Потврда за платени царински давачки',
        ]);
        Relateddocuments::create([
            'desc' => 'Потврда за исполнување на техничките барања со технички карактеристики, издадена од производителот на возилото (СОС)',
        ]);
        Relateddocuments::create([
            'desc' => 'Потврда за исполнување на техничките барања со список на одобренија издадена од овластен застапник на производителот на возилото во Република Северна Македонија',
        ]);
        Relateddocuments::create([
            'desc' => 'Потврда за исполнување на техничките барања со список на одобренија издадена од независна институција прифатена од органот за одобрување',
        ]);
        Relateddocuments::create([
            'desc' => 'Фотокопија од странска сообраќајна дозвола за возилото',
        ]);
        Relateddocuments::create([
            'desc' => 'Возило за преглед',
        ]);
        Relateddocuments::create([
            'desc' => 'Упатница од МВР за испитување поради одобрување на преправено/поправено возило',
        ]);
        Relateddocuments::create([
            'desc' => '	Потврда за вградување на уредот издадена од овластено правно лице',
        ]);
        Relateddocuments::create([
            'desc' => 'Одобренија и друга документација за дополнително вградениот уред',
        ]);
        Relateddocuments::create([
            'desc' => 'Табеларен преглед на вградени елементи на уредот за погон на ТНГ издадена од вградувачот',
        ]);
        Relateddocuments::create([
            'desc' => 'Уверение за извршен преглед на садот под притисок / резервоарот за ТНГ',
        ]);
        Relateddocuments::create([
            'desc' => 'Фабрички документ за мултифункционалниот вентил монтиран на резервоарот за ТНГ',
        ]);
        Relateddocuments::create([
            'desc' => 'Фабрички документ за регулаторот на притисок на ТНГ / испарувач',
        ]);
        Relateddocuments::create([
            'desc' => '	Фабричка шема на вградените електронски елементи во уредот за ТНГ (само за системи со електронско вбризгување на гориво)',
        ]);
        Relateddocuments::create([
            'desc' => 'Фотокопија сообраќајна дозвола со оригинал на увид',
        ]);
        Relateddocuments::create([
            'desc' => '	Фотокопија од предходната сообраќајна дозвола со оригинал за увид (за возилата што претходно биле регистрирани)',
        ]);
        Relateddocuments::create([
            'desc' => '	Фотокопија од потврдата за сообразност за ЕУ одобрување на возилото- Certificate of conformity, издаден од непосредниот производител на возилото – COC, со оригинал за увид',
        ]);
        Relateddocuments::create([
            'desc' => 'Доказ за статусот на хуманитарната организација од членот 24 точка 6 од Законот за возила, издаден од надлежен државен орган',
        ]);
        Relateddocuments::create([
            'desc' => 'Фотокопија од потврдата за сообразност за ЕУ одобрување на возилото- Certificate of conformity (за ново или половно возило), издаден од непосредниот производител на возилото – COC, со оригинал за увид или други документи со кои се потврдува дека возилото е од одобрен тип во Р. Северна Македонија.',
        ]);
        Relateddocuments::create([
            'desc' => 'Доказ за регулирани царински давачки за возилото (фотокопија со оригинал за увид)',
        ]);
        Relateddocuments::create([
            'desc' => 'Известување од Бирото за метрологија (Административна постапка за одобрување започнува со пристигнување на “Известување”од Органот за одобрување-Бирото за метрологија)',
        ]);
        Relateddocuments::create([
            'desc' => 'Барање за преглед на документацијата за одобрување и возило во постапка за одобрување на тип возило,во согласност со известувањето добиено од Органот за одобрување заверено со печат,архивски број и платена административна такса;',
        ]);
        Relateddocuments::create([
            'desc' => '	Уредно пополнет информативен пакет за возилото;',
        ]);
        Relateddocuments::create([
            'desc' => 'Оригинал или заверена со печат и потпис копија од СОС документ (за возилата за кои типот е одобрен согласно хармонизираните европски прописи-WVTA)',
        ]);
        Relateddocuments::create([
            'desc' => 'Потврда за отворање на постапка за идентификација издадена од органот за одобрување со која се потврдува исполнетоста на статусот на барателот согласно одредбите од членот 24 од Законот за возила',
        ]);
        Relateddocuments::create([
            'desc' => 'Доказ за регулирани царински давачки за возилото (фотокопија со оригинал за увид)',
        ]);
        Relateddocuments::create([
            'desc' => 'Фотокопија од предходната сообраќајна дозвола со оригинал за увид (за половните возила)',
        ]);
    }
}
